{
    "version": "https://jsonfeed.org/version/1",
    "title": "beboth",
    "description": "",
    "home_page_url": "https://github.com/vickkerokc/beboth",
    "feed_url": "https://github.com/vickkerokc/beboth/feed.json",
    "user_comment": "",
    "author": {
        "name": "Vicki Langford"
    },
    "items": [
        {
            "id": "https://github.com/vickkerokc/beboth/i-am-both.html",
            "url": "https://github.com/vickkerokc/beboth/i-am-both.html",
            "title": "I am Both",
            "summary": "April 5 2020 Be Both is born. On this day, We are in the midst of a pandemic. COVID-19. We are in a global health system crisis. We are in an economic shutdown crisis. Extreme measures in order to control the virus spread and flatten&hellip;",
            "content_html": "\n  <p>\n    April 5 2020 Be Both is born.\n<br>\n<br>On this day, We are in the midst of a pandemic. COVID-19. We are in a global health system crisis. We are in an economic shutdown crisis. Extreme measures in order to control the virus spread and flatten the curve.\n<br>\n<br>We are scared and frustrated and annoyed. We are hopeful and resilient and survivors.\n<br>\n<br>This pandemic is perhaps the extreme situation that is going to help us as a society get our heads out of our asses and come to terms with how our unwillingness to compromise and collaborate doesn’t help us. One side isn’t right and the other side wrong. There is truth on both sides. We must come to the table respecting the need for both the head and the heart and find the common thread between our ideals. When we respect the economic needs and the social needs, and don’t make one more important, that is were innovative and creative solutions are discovered.\n<br>\n<br>Prior to this pandemic, here’s some of my values and opinions.\n<br>\n<br>I think it is everyone’s right to good education and good healthcare. I own real estate and I am a business owner. I am concerned with the environmental issues facing us. I want to grow my business and make a profit. I want to provide for the employees and take care of the planet. I want to have efficient systems and sustainable ones too. I value natural local grown food. I’m not a cook though. I think neighbours and community should help each other. I don’t want to sacrifice one for the other. In our modern sophisticated society we have the means and resources to be good stewards and to be prosperous.\n<br>\n<br>I’m a liberal and a conservative. Wait what?\n<br>\n<br>Then it hit me. We can be both. We can have a solid economic engine without destroying the ecosystem. We can embrace prolonging life and learn to die gracefully. We can have health and wealth. We can have business and family.\n<br>\n<br>This is what this pandemic has taught me thus far.\n<br>\n<br>We need both.\n<br>\n<br>We can #beboth&nbsp;<br>\n  </p>",
            "image": "https://github.com/vickkerokc/beboth/media/posts/2/biggest-beboth-header.jpg",
            "author": {
                "name": "Vicki Langford"
            },
            "tags": [
                   "Op-Eds"
            ],
            "date_published": "2025-07-12T09:57:04-05:00",
            "date_modified": "2025-07-12T13:40:52-05:00"
        }
    ]
}
