{
    "version": "https://jsonfeed.org/version/1",
    "title": "beboth",
    "description": "",
    "home_page_url": "https://beboth.org",
    "feed_url": "https://beboth.org/feed.json",
    "user_comment": "",
    "author": {
        "name": "Vicki Langford"
    },
    "items": [
        {
            "id": "https://beboth.org/done-are-the-days.html",
            "url": "https://beboth.org/done-are-the-days.html",
            "title": "Done are the days.",
            "summary": "If you are in the business of selling a gizmo or a gadget that doesn't serve a purpose, that doesn't add value then be leery. The future will be a challenge. Done are the days where we work and work to buy stuff we don't&hellip;",
            "content_html": "\n  <p>\n    If you are in the business of selling a gizmo or a gadget that doesn't serve a purpose, that doesn't add value then be leery.  The future will be a challenge.\n<br>\n<br>Done are the days where we work and work to buy stuff we don't need. Stuff to store and then toss aside when we're bored with it.  \n<br>\n<br>Done are the days of buying hundreds of plastic toys representing the corporate companies profiting from them. \n<br>\n<br>We have made so much excess our trash dumps are filled with so much discarded items we once needed so desperately.   \n<br>\n<br>We don't need to toil away shuffling paperwork and looking at computers trying to analyze data that doesn't make any sense. Our systems are bloated, ineffective and wasteful. \n<br>\n<br>One size fits all systems, like the food pyramid, education system, business strategy, everything is mired in a one size fits all -- do it this way and you have the desired outcome. As society got larger and means of disseminating information became easier, institutional systems focused on normalizing everything in life. Give the people the answers they seek. Tell them how to stay healthy and raise the kids and what an education looks like, and what will set someone up for success.  \n<br>\n<br>The appointed expert said to eat 3 meals a day, breakfast is the most important meal of the day, fat is bad, etc etc. Then enter unnatural substitutes laced in processed sugar. Advertising agencies said we need this type of appliance, this car, this dress to be accepted and successful. Education experts said kids should all be expected to sit behind a desk all day and memorize reading, writing, arithmetic.  \n<br>\n<br>We ALL are so aware of these man made systems that these are satirized in our entertainment over and over again.  This wasn’t malicious, we the people were trying to help.  We the people were trying to make a name for ourselves.  We the people came up with solutions and marketed that one solution as gospel so to speak.  \n<br>\n<br>But while there are commonalities and majorities, our differences are not meant to be drowned out.  We are all practically the same in our biology, but it's that small percentage that needs to rise up and create our unique spark.\n<br>\n<br>It is rising. Let’s pause, listen and reflect and let it rise. \n<br>\n<br>We have externalized all our senses and emotions. We value our ability to think and solve problems rationally using facts.  This in and of itself isn't bad.  But after decades of focusing on these systems and paths to a good life, we lost something.  We lost our connection to our interconnectedness.  We don’t hear the signals the body tells us until it's too late.  We are frustrated because we did everything (mostly) that we were told to do but yet still… we suffer.  And these external tools might alleviate for a short while but they don’t fix what ails us.  \n<br>\n<br>We exist in the pendulum swings of over correcting.  \n<br>Too much stuff morphs into the minimalist lifestyle.  \n<br>Over-reliance on institutions morphs into off grid.  \n<br>Rigorous academics morphs into homeschooling. \n<br>Organized religion and overzealous evangelists morph into new age speakers explaining their path to enlightenment. We are still paying, it's just not called tithing but capitalism with all the money spent on self-help books, classes, workshops, retreats.  \n<br>\n<br>The goal is not to resort back to the dark ages. I’m not trying to romanticize the good ole days.  We’ve evolved from there.  And let's face it, many of our modern technologies are why we are evolved to even think about this. Our planet is more accessible and we can learn anything and communicate with anyone anywhere.  These are good things. Being able to type on this electronic device whether daylight or dark is a good thing. The advances in medicine and the advancing exploration of quantum and how our DNA works is exactly why I can envision designing a different lifestyle.  Because of the internet and all the information and examples shared, I’m afforded to explore my desire for something beyond the hustle and grind, live to work mentality we’ve idolized for well the bulk of my life.   \n<br>\n<br>In all these swings there lies a balance. Balance is tolerance.  Balance is accepting\n<br>There is truth in all these presentations.  The truth in both the reactive and the repressive ways we over correct and over process to find what? We don't even know what we are looking for.  \n<br>\n<br>As I've wrestled with finding myself over the years, right now the thing that started me on this journey is the mantra.  Do less. Strip things back, do less.  The important stuff rises up or actually becomes more clear as the unimportant falls away.  You'll start to notice the man made rules, deadlines, milestones are not what is important.  We need structure, like the rules of the road, so we don't crash into each other, but think about it. mon-fri 9-5 --- man made. \n<br>\n<br>We've evolved past that now.  Let's dare to imagine what's next. Let’s turn inward and listen. Listen to our inner knowing and get to know ourselves and what we want our lives to look like. \n<br>\n<br>We need some stillness in our lives.  We need connection and community.  \n<br>\n<br>We need food, shelter, safety and sex.  \n<br>\n<br>Instead of growing the bottom line, let's grow food and flowers \n<br>\n<br>Instead of building portfolios, let's build sustainable community\n<br>\n<br>Instead of inventing pills to help our symptoms, let's heal our hearts and souls.\n<br>\n<br>Let's heal the earth in the process. Honor the ground, the animals and the water. These things sustain us.  \n<br>\n<br>Let's pick and choose the technology we keep in our lives. The content we consume. The ways to travel. \n<br>\n<br>Let's live.  \n<br>\n<br>\n<br>\n  </p>",
            "author": {
                "name": "Vicki Langford"
            },
            "tags": [
                   "Op-Eds"
            ],
            "date_published": "2025-09-01T06:10:09-05:00",
            "date_modified": "2025-09-01T06:10:27-05:00"
        },
        {
            "id": "https://beboth.org/pro-choice.html",
            "url": "https://beboth.org/pro-choice.html",
            "title": "pro choice",
            "summary": "Full disclosure: This is what I believe.&nbsp; The decision regarding birth control and whether to have a child or not should 100% be a decision that doesn’t involve any politics because it is a very personal choice.&nbsp; vicki langford Where it starts for a woman&hellip;",
            "content_html": "\n    <h2 id=\"full-disclosure-this-is-what-i-believeandnbsplessbrgreater\">\n      Full disclosure: This is what I believe.&nbsp;<br>\n    </h2>\n\n    <figure class=\"blockquote\">\n      <blockquote>The decision regarding birth control and whether to have a child or not should 100% be a decision that doesn’t involve any politics because it is a very personal choice.&nbsp;</blockquote>\n      <figcaption>vicki langford</figcaption>\n    </figure>\n\n    <h3 id=\"where-it-starts-for-a-woman\">\n      Where it starts for a woman\n    </h3>\n\n  <p>\n    As women, we start having doctors appointments pretty young. Often as teenagers.  And let’s be blunt for those men who don’t understand.  When we go to a gynaecologist, we get naked and have a hospital gown on, then get on the exam table, put our feet up, and skooch down toward the edge of table.  Then the doctor puts a metal device in our vagina and opens it so to get a good view of the cervix and then takes a swab to get a tissue sample for testing.   That is a pap smear and it is recommended we get those annually. Every year. For our entire life…\n<br>\n<br>So yeah, our relationship with our gynaecologist is intimate and respected.  \n<br>\n<br>Now imagine you have a different doctor every time? Imagine the anxiety this type of procedure can bring up? Sometimes to get through, we have to just gut out that whole procedure.  It isn’t easy.  It’s scary and stressful.\n<br>\n<br>If we are fortunate we are able to select a doctor that we trust and see that same doctor year after year.  Even if the doctor themselves isn’t the same, the facility and support staff are familiar and that familiarity helps to ease our anxiety.\n<br>\n<br>Through the many times we see our doctor for normal checkups and to treat normal issues, like UTI’s or vaginal yeast infections, we form a relationship. It’s often our doctor that helps us decide our birth control options. Our doctor shares pamphlets and knowledge and experience and explains our choices.  Our doctor knows us and knows our history.\n<br>\n<br>When a women gets pregnant, regardless of the situation, she wants to be able to discuss her choices and options with a trusted doctor that already knows her.  The restrictions of our normal doctors not being able to preform an abortion and the fact that abortion clinics are still being targeted by protesters and are not covered by insurance at all, make the whole conversation very uncomfortable.  A women is now having to go to a strange facility, talk intimate medical and personal details with a doctor that is a stranger, and thus makes this hard situation much more difficult.&nbsp;&nbsp;<br>\n  </p>\n\n    <h3 id=\"desensitised\">\n      Desensitised\n    </h3>\n\n  <p>\n    When a women has no option but impersonal care, we become desensitized to our body.  We compartmentalize in our mind in order to get through the uncomfortable. \n<br>\n<br>Some women avoid the anxiety of the impersonal nature created and thus are never explained all the birth control options or what all is happening in her body. \n<br>\n<br>Nurturing the relationship our young women have with their body and how it works from the beginning with wellness centers that ease us into the first experience of a pap smear and help us understand appropriate touch would go along way into preventing unwanted pregnancy.&nbsp;<br>\n  </p>\n\n    <h3 id=\"when-does-life-startandnbsp\">\n      when does life start?&nbsp;\n    </h3>\n\n  <p>\n    This has no place in the debate about medical procedures.&nbsp; No one knows.&nbsp; We can postulate and theorise, we can believe and have faith. But we don't know.&nbsp; This is not defensible and this is not what policy should include.&nbsp;&nbsp;\n  </p>\n\n    <h3 id=\"body-freedom\">\n      Body Freedom\n    </h3>\n\n  <p>\n    The medical procedure should not be regulated by the government.  People are allowed to do all kinds of things to their bodies going to legitimate doctors, with legitimate licences and while some of things are elective and aren’t covered by insurance, we are allowed.  Those doctors selling those procedures even offer payment plans or financing. \n<br>\n<br>People get nose jobs, boob jobs, tummy tucks, chin implants, penis implants, tattooed makeup, etc etc.  The medical profession has their own oversight and research to do these procedures with the least risk and with much training. \n<br>\n<br>Government does not need to tell people what is morally right or wrong about any of these elective procedures.  It’s a free country.  You do you.  If there is a demand for certain services there will be doctors that are willing to do them. \n<br>\n<br>If it’s acceptable to get eggs and sperm inserted in my vagina, then it should be acceptable to get them taken out. \n<br>\n<br>The decision is personal and the reasons to decide are not one size fits all.  These are complex emotional decisions.  Decisions that men and women do discuss, but they aren’t calling their senator or congressperson.<br>\n  </p>\n\n    <h2 id=\"where-it-ends-for-a-womanlessbrgreater\">\n      Where it ends for a woman<br>\n    </h2>\n\n  <p>\n    She will talk with her partner, her family, her friends, her partner, her doctor, her clergy, her therapist, her counsellor, her local women’s organisation, heck even her HR person at her job. She is going to be discussing her situation, the specific details that landed in her here, and she will discussing it with people that know her. They are best suited for this conversation and will be able to help her weigh the pros and cons. She will be thinking about her life, her financial ability to care and provide for a child.\n<br>\n<br>She can choose for herself.&nbsp;\n  </p>",
            "author": {
                "name": "Vicki Langford"
            },
            "tags": [
                   "Op-Eds"
            ],
            "date_published": "2023-10-16T15:34:00-05:00",
            "date_modified": "2025-07-13T15:46:49-05:00"
        },
        {
            "id": "https://beboth.org/i-am-both.html",
            "url": "https://beboth.org/i-am-both.html",
            "title": "I am Both",
            "summary": "April 5 2020 Be Both is born. On this day, We are in the midst of a pandemic. COVID-19. We are in a global health system crisis. We are in an economic shutdown crisis. Extreme measures in order to control the virus spread and flatten&hellip;",
            "content_html": "\n  <p>\n    April 5 2020 Be Both is born.\n<br>\n<br>On this day, We are in the midst of a pandemic. COVID-19. We are in a global health system crisis. We are in an economic shutdown crisis. Extreme measures in order to control the virus spread and flatten the curve.\n<br>\n<br>We are scared and frustrated and annoyed. We are hopeful and resilient and survivors.\n<br>\n<br>This pandemic is perhaps the extreme situation that is going to help us as a society get our heads out of our asses and come to terms with how our unwillingness to compromise and collaborate doesn’t help us. One side isn’t right and the other side wrong. There is truth on both sides. We must come to the table respecting the need for both the head and the heart and find the common thread between our ideals. When we respect the economic needs and the social needs, and don’t make one more important, that is were innovative and creative solutions are discovered.\n<br>\n<br>Prior to this pandemic, here’s some of my values and opinions.\n<br>\n<br>I think it is everyone’s right to good education and good healthcare. I own real estate and I am a business owner. I am concerned with the environmental issues facing us. I want to grow my business and make a profit. I want to provide for the employees and take care of the planet. I want to have efficient systems and sustainable ones too. I value natural local grown food. I’m not a cook though. I think neighbours and community should help each other. I don’t want to sacrifice one for the other. In our modern sophisticated society we have the means and resources to be good stewards and to be prosperous.\n<br>\n<br>I’m a liberal and a conservative. Wait what?\n<br>\n<br>Then it hit me. We can be both. We can have a solid economic engine without destroying the ecosystem. We can embrace prolonging life and learn to die gracefully. We can have health and wealth. We can have business and family.\n<br>\n<br>This is what this pandemic has taught me thus far.\n<br>\n<br>We need both.\n<br>\n<br>We can #beboth&nbsp;<br>\n  </p>",
            "image": "https://beboth.org/media/posts/2/biggest-beboth-header.jpg",
            "author": {
                "name": "Vicki Langford"
            },
            "tags": [
                   "Op-Eds"
            ],
            "date_published": "2020-04-05T09:57:00-05:00",
            "date_modified": "2025-07-13T15:47:16-05:00"
        }
    ]
}
